In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
lables = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20, 'c':30}

In [5]:
pd.Series(my_data,lables)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,d)

a    10
b    20
c    30
dtype: int64

In [7]:
type(d)

dict

In [9]:
s1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [10]:
s2 = pd.Series([1,3,4,5],['USA','India','USSR','Germany'])

In [14]:
s3 = pd.Series(data=lables)

In [17]:
s3[2]

'c'

In [20]:
s1/s2

Germany    0.40
India       NaN
Japan       NaN
USA        1.00
USSR       0.75
dtype: float64

In [21]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df[['W','Y']].std()

W    1.681131
Y    1.454516
dtype: float64

In [30]:
df['new'] = df['W']+df['Y']

In [31]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('new', axis=1, inplace=True)

In [39]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [41]:
df.shape

(5, 4)

In [42]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [44]:
df.iloc[1:]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.loc['B','Y']

-0.8480769834036315

In [46]:
df.loc[['A',"B"],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [48]:
booldf = df > .1

In [49]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df[df<.1]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [54]:
resultdf = df[df['W']>.1]

In [56]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [57]:
df[df['W']>.1]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [61]:
df[df['W']>.1][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [66]:
df[(df['W']>.1) | (df['Y']<.1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [69]:
newind = 'CA WB NY DM MM'.split()

In [70]:
df['States'] = newind

In [73]:
df.set_index('States', inplace=True)

In [74]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
WB      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
DM      0.188695 -0.758872 -0.933237  0.955057
MM      0.190794  1.978757  2.605967  0.683509

In [75]:
out = ['G1','G1','G1','G2','G2','G2']
In = [1,2,3,1,3,2]

In [76]:
hier_index = list(zip(out,In))

In [77]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 3), ('G2', 2)]

In [78]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [79]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 3),
            ('G2', 2)],
           )

In [80]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [81]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   3  0.807706  0.072960
   2  0.638787  0.329646

In [83]:
df.loc['G2'].iloc[1]

A    0.807706
B    0.072960
Name: 3, dtype: float64

In [85]:
df.index.names = ['Groups', 'Num']

In [86]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       3    0.807706  0.072960
       2    0.638787  0.329646

In [90]:
df.loc['G2'].iloc[1]['B']

0.07295967531703869

In [93]:
df.loc['G1'].iloc[1]['A']

-1.7060859307350775

In [94]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528